##  Number of Unique Subjects Taught by Each Teacher Leetcode Task21

In [1]:
import pandas as pd
import numpy as np

In [22]:
data = [[1, 2, 3], [1, 2, 4], [1, 3, 3], [2, 1, 1], [2, 2, 1], [2, 3, 1], [2, 4, 1]]
Teacher = pd.DataFrame(data, columns=['teacher_id', 'subject_id', 'dept_id']).astype({'teacher_id':'Int64', 'subject_id':'Int64', 'dept_id':'Int64'})

In [23]:
Teacher

   teacher_id  subject_id  dept_id
0           1           2        3
1           1           2        4
2           1           3        3
3           2           1        1
4           2           2        1
5           2           3        1
6           2           4        1

In [24]:
Teacher=Teacher[['teacher_id','subject_id']].drop_duplicates()
Teacher

   teacher_id  subject_id
0           1           2
2           1           3
3           2           1
4           2           2
5           2           3
6           2           4

In [25]:
Teacher=Teacher.groupby('teacher_id').count().reset_index()
Teacher.rename(columns={'subject_id':'cnt'} , inplace=True)
Teacher

   teacher_id  cnt
0           1    2
1           2    4